In [1]:
import functools as ft
from graphviz import Digraph
from ipywidgets import interact, interactive, fixed
import ipywidgets as widgets
from IPython.display import Math
from IPython.display import Latex
from IPython.display import HTML
from matplotlib import pyplot as plt
import math
import numpy as np
import numpy.polynomial as np_poly
import os
import pandas as pd
from pprint import pprint
import random
import scipy as sp

from __future__ import print_function

%matplotlib inline

DIR_HOME = os.environ['HOME']
DIR_REPOS = DIR_HOME + "/neo-human/repos"
DIR_BMLSP = DIR_REPOS + "/luispedro/BuildingMachineLearningSystemsWithPython"

In [4]:
from pandas import Series, DataFrame

initialization
$
\newcommand{\Brace}[1]{\left\{#1\right\}}
\newcommand{\Bracket}[1]{\left[#1\right]}
\newcommand{\cases}[1]{\begin{cases}#1\end{cases}}
\newcommand{\cov}[1]{\text{cov} \sigma\left[#1\right]}
\newcommand{\diff}[2]{\frac{d #1}{d #2}}
\newcommand{\difftwo}[2]{\frac{d^2 #1}{d {#2}^2}}
\newcommand{\diffn}[2]{{#1}^{\prime}(#2)}
\newcommand{\ds}{\displaystyle}
\newcommand{\E}[1]{\mathbb{E}\left[ #1 \right]}
\newcommand{\expb}[1]{\exp\left\{#1\right\}} 
\newcommand{\EXP}[1]{\exp\left\{#1\right\}} 
\newcommand{\frachalf}[1]{\frac{#1}{2}~}
\newcommand{\fracone}[1]{\frac{1}{#1}~}
\newcommand{\fracrec}[1]{\frac{1}{#1}~}
\newcommand{\half}{\fracone{2}}
\newcommand{\H}[1]{\mathbb{H}\left[#1\right]}
\newcommand{\Int}[2]{\displaystyle \int_{#1}^{#2}~}
\newcommand{\intinfinf}{\Int{-\infty}{\infty}}
\newcommand{\inv}[1]{#1^{-1}}
\newcommand{\invp}[1]{\left({#1}\right)^{-1}}
\newcommand{\KL}[2]{\text{KL}\left(#1 \Vert #2\right)}
\newcommand{\Lim}[1]{\displaystyle \lim_{#1}}
\newcommand{\Ln}[1]{\ln \left\(#1\right\)}
\newcommand{\Lnb}[1]{\ln \left\{#1\right\} }
\newcommand{\Mod}[1]{\left|#1\right|}
\newcommand{\Norm}[1]{\left\lVert #1 \right\rVert}
\newcommand{\Normsqr}[1]{\Norm{#1}^2}
\newcommand{\map}[1]{#1_{\text{MAP}}}
\newcommand{\ml}[1]{#1_{\text{ML}}}
\newcommand{\MI}[1]{\mathcal{I}\left(#1\right)}
\newcommand{\P}{\mathbb{P}}
\newcommand{\Paran}[1]{\left(#1\right)}
\newcommand{\Partial}[2]{\frac{\partial #1}{\partial #2}}
\newcommand{\sqrbrkt}[1]{\Bracket{#1}^2}
\newcommand{\sqrbrc}[1]{\Brace{#1}^2}
\newcommand{\trace}[1]{\text{Tr}\left( #1 \right)}
\newcommand{\traceb}[1]{\text{Tr}\left\{#1\right\}}
\newcommand{\underl}[1]{\text{$\underline{#1}$}}
\newcommand{\V}[1]{\mathbb{V}\left[#1\right]}
$
$
\DeclareMathOperator*{\argmin}{arg\,min}
\DeclareMathOperator*{\argmax}{arg\,max}
$
$
\newcommand{\mat}[1]{ \left[ \begin{matrix} #1 \end{matrix} \right] }
\newcommand{\matp}[1]{ \left( \begin{matrix} #1 \end{matrix} \right)}
\newcommand{\mats}[1]{ \begin{matrix}#1\end{matrix} }
\newcommand{\arrthree}[1]{
\begin{array}{rlr} #1 \end{array}}
$

$
\newcommand{\C}{\mathbb{C}}
\newcommand{\Ca}{\mathcal{C}}
\newcommand{\Caone}{\Ca_1}
\newcommand{\Catwo}{\Ca_2}
\newcommand{\Cak}{\Ca_k}
\newcommand{\D}{\mathcal{D}}
\newcommand{\G}{\mathcal{G}}
\newcommand{\I}{\mathcal{I}}
\newcommand{\L}{\mathcal{L}}
\newcommand{\M}{\mathcal{M}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\R}{\mathbb{R}}
\newcommand{\Ra}{\mathcal{R}}
$
$
\newcommand{\commentgray}[1]{\color{gray}{\text{#1}}}
$

sum, product
$
\newcommand{\sumi}{\displaystyle \sum_i}
\newcommand{\sumiD}{\displaystyle \sum_{i=1}^{D}}
\newcommand{\sumiL}{\displaystyle \sum_{i=1}^{L}}
\newcommand{\sumiN}{\displaystyle \sum_{i=1}^{N}}
\newcommand{\sumjD}{\displaystyle \sum_{j=1}^{D}}
\newcommand{\sumjK}{\displaystyle \sum_{j=1}^{K}}
\newcommand{\sumjMl}{\sum_{j=1}^{M-1}}
\newcommand{\sumkK}{\displaystyle \sum_{k=1}^{K}}
\newcommand{\sumkM}{\displaystyle \sum_{k=1}^{M}}
\newcommand{\sumkMl}{\sum_{k=1}^{M-1}}
\newcommand{\sumkp}{\displaystyle \sum_{k=1}^{p}}
\newcommand{\summN}{\displaystyle \sum_{m=1}^{N}}
\newcommand{\sumnN}{\displaystyle \sum_{n=1}^{N}}
$
$
\newcommand{\prodi}{\displaystyle \prod_i}
\newcommand{\prodiD}{\displaystyle \prod_{i=1}^{D}}
\newcommand{\prodiL}{\displaystyle \prod_{i=1}^{L}}
\newcommand{\prodiN}{\displaystyle \prod_{i=1}^{N}}
\newcommand{\prodjK}{\displaystyle \prod_{j=1}^{K}}
\newcommand{\prodkK}{\displaystyle \prod_{k=1}^{K}}
\newcommand{\prodmN}{\displaystyle \prod_{m=1}^{N}}
\newcommand{\prodnN}{\displaystyle \prod_{n=1}^{N}}
$

alphabet shortcuts
$
\newcommand{\ab}{\mathbf{a}}
\newcommand{\at}{\ab^T}
\newcommand{\Ab}{\mathbf{A}}
\newcommand{\At}{\Ab^T}
\newcommand{\Ai}{\inv{\Ab}}
\newcommand{\Abjk}{\Ab_{jk}}
\newcommand{\bb}{\mathbf{b}}
\newcommand{\bt}{\bb^T}
\newcommand{\Bb}{\mathbf{B}}
\newcommand{\Bt}{\Bb^T}
\newcommand{\Cb}{\mathbf{C}}
\newcommand{\Cn}{\Cb_{N}}
\newcommand{\Db}{\mathbf{D}}
\newcommand{\fb}{\mathbf{f}}
\newcommand{\fp}{f^{\prime}}
\newcommand{\Hb}{\mathbf{H}}
\newcommand{\hx}{h(\xb)}
\newcommand{\Jb}{\mathbf{J}}
\newcommand{\kb}{\mathbf{k}}
\newcommand{\kt}{\kb^T}
\newcommand{\Kb}{\mathbf{K}}
\newcommand{\Lb}{\mathbf{L}}
\newcommand{\Lt}{\Lb^T}
\newcommand{\Lbi}{\Lb^{-1}}
\newcommand{\mb}{\mathbf{m}}
\newcommand{\mt}{\mb^T}
\newcommand{\mbn}{\mb_N}
\newcommand{\mbnt}{\mbn^T}
\newcommand{\mbN}{\mb_N}
\newcommand{\mbNt}{\mbn^T}
\newcommand{\Mb}{\mathbf{M}}
\newcommand{\Qb}{\mathbf{Q}}
\newcommand{\Rb}{\mathbf{R}}
\newcommand{\sb}{\mathbf{s}}
\newcommand{\Sb}{\mathbf{S}}
\newcommand{\tb}{\mathbf{t}}
\newcommand{\tbnn}{\tb_{N}}
\newcommand{\tbnp}{\tb_{N+1}}
\newcommand{\tt}{\tb^T}
\newcommand{\Tb}{\mathbf{T}}
\newcommand{\Tt}{\Tb^T}
\newcommand{\ub}{\mathbf{u}}
\newcommand{\Ub}{\mathbf{U}}
\newcommand{\Ut}{\Ub^T}
\newcommand{\vb}{\mathbf{v}}
\newcommand{\Vb}{\mathbf{V}}
\newcommand{\wb}{\mathbf{w}}
\newcommand{\wnr}[1]{\wb^{(\text{#1})}}
\newcommand{\wt}{\wb^T}
\newcommand{\Wb}{\mathbf{W}}
\newcommand{\Wt}{\Wb^T}
\newcommand{\Wtilde}{\widetilde{\Wb}}
\newcommand{\Wtildet}{\Wtilde^T}
\newcommand{\Xb}{\mathbf{X}}
\newcommand{\Xt}{\Xb^T}
\newcommand{\Xk}{\Xb_k}
\newcommand{\Xkt}{\Xk^T}
\newcommand{\Xtilde}{\widetilde{\Xb}}
\newcommand{\Xtildet}{\Xtilde^T}
\newcommand{\xb}{\mathbf{x}}
\newcommand{\xt}{\xb^T}
\newcommand{\xtilde}{\widetilde{\xb}}
\newcommand{\xtilden}{\xtilde_n}
\newcommand{\xtildent}{\xtilden^T}
\newcommand{\xp}{x^{\prime}}
\newcommand{\xbp}{\xb^{\prime}}
\newcommand{\xbm}{\xb_m}
\newcommand{\xbn}{\xb_n}
\newcommand{\xbnp}{\xb_{N+1}}
\newcommand{\xab}{\mathbf{x_a}}
\newcommand{\xabt}{\mathbf{x_a}^T}
\newcommand{\xbb}{\mathbf{x_b}}
\newcommand{\xbbt}{\mathbf{x_b}^T}
\newcommand{\yb}{\mathbf{y}}
\newcommand{\yt}{\yb^T}
\newcommand{\yx}{y(\xb)}
\newcommand{\Yb}{\mathbf{Y}}
\newcommand{\Yt}{\Yb^T}
\newcommand{\zb}{\mathbf{z}}
\newcommand{\zt}{\zb^T}
\newcommand{\zbm}{\zb_m}
\newcommand{\zbn}{\zb_n}
\newcommand{\zbnp}{\zb_{n-1}}
\newcommand{\znk}{\zb_{nk}}
\newcommand{\znpj}{\zb_{n-1,j}}
\newcommand{\Zb}{\mathbf{Z}}
$

math shortcuts
$
\newcommand{\alphab}{\pmb{\alpha}}
\newcommand{\alphabt}{\alphab^T}
\newcommand{\betab}{\pmb{\beta}}
\newcommand{\betabp}{\betab^{\prime}}
\newcommand{\chib}{\boldsymbol{\chi}}
\newcommand{\etab}{\pmb{\eta}}
\newcommand{\etabp}{\etab^{\prime}}
\newcommand{\etat}{\eta^T}
\newcommand{\etabt}{\etab^T}
\newcommand{\Lambdab}{\pmb{\Lambda}}
\newcommand{\laa}{\Lambda_{aa}}
\newcommand{\laai}{\Lambda_{aa}^{-1}}
\newcommand{\lab}{\Lambda_{ab}}
\newcommand{\lba}{\Lambda_{ba}}
\newcommand{\lbb}{\Lambda_{bb}}
\newcommand{\lbbi}{\Lambda_{bb}^{-1}}
\newcommand{\li}{\Lambda^{-1}}
\newcommand{\Li}{\Lambda^{-1}}
\newcommand{\mub}{\pmb{\mu}}
\newcommand{\mut}{\mub^T}
\newcommand{\muab}{\pmb{\mu}_a}
\newcommand{\mubb}{\pmb{\mu}_b}
\newcommand{\Phib}{\pmb{\Phi}}
\newcommand{\Phibt}{\Phib^T}
\newcommand{\pib}{\pmb{\pi}}
\newcommand{\sigmasqr}{\sigma^2}
\newcommand{\saa}{\Sigma_{aa}}
\newcommand{\sab}{\Sigma_{ab}}
\newcommand{\sba}{\Sigma_{ba}}
\newcommand{\sbb}{\Sigma_{bb}}
\newcommand{\Sigmai}{\inv{\Sigma}}
\newcommand{\thetab}{\pmb{\theta}}
\newcommand{\thetat}{\thetab^T}
\newcommand{\thetabh}{\hat{\thetab}}
\newcommand{\thetaold}{\thetab^{\text{old}}}
$
$
\newcommand{\zerob}{\pmb{0}}
\newcommand{\oneb}{\pmb{1}}
\newcommand{\ed}{\mathbb{E}_{\D}}
\newcommand{\edyx}{\ed\left[y(\xb ; \D)\right]}
\newcommand{\dx}{~dx}
\newcommand{\dxb}{~d\xb}
\newcommand{\pxdxb}{p(\xb) \dxb}
\newcommand{\dwb}{~d\wb}
$

aliases for distributions
$\newcommand{\multivarcoeff}{\frac{1}{(2\pi)^{D/2}}
\frac{1}{\left| \mathbf{\Sigma}\right|^{1/2}}}$
$\newcommand{\multivarexp}[2]
{
\left\{
 -\frac{1}{2} 
 {#1}^T 
 #2
 {#1}
\right\}
}$
$\newcommand{\multivarexpx}[1]{\multivarexp{#1}{\Sigma^{-1}}}$
$\newcommand{\multivarexpstd}{\multivarexpx{(\xb-\mub)}}$
$\newcommand{\gam}{\operatorname{Gam}}$
$
\newcommand{\Nl}[3]{\mathcal{N}\left(#1 \mid #2, #3\right)}
\newcommand{\Nstdx}{\Nl{\mathbf{x}}{\mathbf{\mu}}{\Sigma}}
$

In [2]:
HTML("<style>"\
    "div.cell{"\
        "width:100%;"\
        "margin-left:0%;"\
        "margin-right:auto;"\
    "}"\
"</style>")

# Combining and merging data sets

## db style df merges

In [5]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df2 = DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [6]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [7]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

`merge()` by default merges on the overlapping col names as merge-keys

In [8]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

specify join keys using "on"

In [9]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

If the column names are different in each object, you can specify them separately:

In [14]:
df3 = DataFrame({
    'l_key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data1': range(7)})
df3

   data1 l_key
0      0     b
1      1     b
2      2     a
3      3     c
4      4     a
5      5     a
6      6     b

In [16]:
df4 = DataFrame({
    'r_key': ['a', 'b', 'd'],
    'data2': range(3)})
df4

   data2 r_key
0      0     a
1      1     b
2      2     d

In [17]:
pd.merge(df3, df4, left_on='l_key', right_on='r_key')

   data1 l_key  data2 r_key
0      0     b      1     b
1      1     b      1     b
2      6     b      1     b
3      2     a      0     a
4      4     a      0     a
5      5     a      0     a

Notice that the keys, "c" in df3 and "d" in df4 have vanished. This is coz merge does an inner-join by default.

arg-name: how
possibles: inner, left, right, outer

In [18]:
pd.merge(df3, df4, left_on='l_key', right_on='r_key', how='outer')

   data1 l_key  data2 r_key
0    0.0     b    1.0     b
1    1.0     b    1.0     b
2    6.0     b    1.0     b
3    2.0     a    0.0     a
4    4.0     a    0.0     a
5    5.0     a    0.0     a
6    3.0     c    NaN   NaN
7    NaN   NaN    2.0     d

Many-to-many merges forms the cartesian product of matching rows

To merge with multiple keys, pass a list of column names:

In [19]:
df_left = DataFrame({
    'key1': ['foo', 'foo', 'bar'],
    'key2': ['one', 'two', 'one'],
    'lval': [1, 2, 3]})
df_left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [20]:
df_right = DataFrame({
    'key1': ['foo', 'foo', 'bar', 'bar'],
    'key2': ['one', 'one', 'one', 'two'],
    'rval': [4, 5, 6, 7]})
df_right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [23]:
pd.merge(df_left, df_right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

Overlapping column names are handled by adding predetermined suffixes.  
This is opposed to sql which adds table-name as a prefix.  

Custom suffixes are specifies with `suffixes` arg

In [26]:
pd.merge(df_left, df_right,
         on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [28]:
pd.merge(df_left, df_right,
         on='key1', suffixes=('_l','_r'))

  key1 key2_l  lval key2_r  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

Table 7-1. merge function arguments

| Argument | Description |
| - | - |
| left | DataFrame to be merged on the left side |
| right | DataFrame to be merged on the right side |
| how | One of 'inner', 'outer', 'left' or 'right' . 'inner' by default |
| on | Column names to join on. Must be found in both DataFrame objects. If not specified and no other join keys given, will use the intersection of the column names in left and right as the join keys |
| left_on | Columns in left DataFrame to use as join keys |
| right_on | Analogous to left_on for left DataFrame |
| left_index | Use row index in left as its join key (or keys, if a MultiIndex) |
| right_index | Analogous to left_index |
| sort | Sort merged data lexicographically by join keys; True by default. Disable to get better performance in some cases on large datasets |
| suffixes | Tuple of string values to append to column names in case of overlap; defaults to ('_x', '_y') . For example, if 'data' in both DataFrame objects, would appear as 'data_x' and 'data_y' in result |
| copy | If False , avoid copying data into resulting data structure in some exceptional cases. By default always copies |

## Merging on index

Using left_index, right_index args

In [32]:
left1 = DataFrame({
    'key': ['a', 'b', 'a', 'a', 'b', 'c'],
    'value': range(6)})
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [31]:
right1 = DataFrame({'group_val': [3.5, 7]}, 
                   index=['a', 'b'])
right1

   group_val
a        3.5
b        7.0

If it is one-to-many, then the indices on the many side is retained

In [37]:
pd.merge(left1, right1, 
         left_on='key',
         right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [36]:
pd.merge(
    left1, right1,
    left_on='key', right_index=True,
    how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

## concat along an axis

Basically, works like np concat

### numpy concat

In [38]:
arr1 = np.arange(12).reshape((3, 4))
arr1

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [40]:
np.concatenate([arr1, arr1], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

### for series

In [ ]:
s1 = Series([0,1], index=['a','b'])
s2 = Series([2,3,4], index=['c','d','e'])
s3 = Series([5,6], index=['f','g'])

concat works on axis=0 by default, producing a series.  
if axis=1 is specified, a df is produced, with cols numbering from 0

In [41]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [42]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [44]:
s4 = pd.concat([s1*5, s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

The default is outer join.   
other joins can be specified.

In [45]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [46]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

### hierarchical indexing

In [49]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])

In [50]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [51]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

rem that concat with axis=1 produces df with cols numbered from 0.  
this col numbering can be changed by specifying `keys` arg

In [42]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [52]:
pd.concat([s1,s2,s3], axis=1,
         keys=['one','two','three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

### for df

In [54]:
df1 = DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [55]:
df2 = DataFrame(5 + np.arange(4).reshape(2, 2), 
                index=['a', 'c'],
                columns=['three', 'four'])
df2

   three  four
a      5     6
c      7     8

w/o keys => normal index  
w/ keys => hierarchical index

In [59]:
pd.concat([df1, df2], axis=1)

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [58]:
pd.concat([df1, df2], axis=1, 
          keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0


If you pass a dict of objects instead of a list, the dict’s keys will be used for the keys option    

If names is passed, it will be assigned to the hierarchical indexing

In [63]:
pd.concat({'level1':df1, 'level2': df2}, 
          axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [62]:
pd.concat([df1, df2], axis=1, 
          keys=['level1', 'level2'],
          names=['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

Ignoring iniices if not relevant

In [65]:
df1 = DataFrame(
    np.random.randn(3, 4),
    columns=['a', 'b', 'c', 'd'])
df1

          a         b         c         d
0  0.776545  0.144113 -0.086412  0.984368
1 -0.495312 -0.547807 -1.324097 -0.055164
2  0.164034  0.586555  0.736100  0.892540

In [64]:
df2 = DataFrame(
    np.random.randn(2, 3), 
    columns=['b', 'd', 'a'])
df2

          b         d         a
0 -1.114333  0.067884 -0.469863
1  1.188342  1.233826  0.448192

In [66]:
pd.concat([df1,df2], ignore_index=True)

          a         b         c         d
0  0.776545  0.144113 -0.086412  0.984368
1 -0.495312 -0.547807 -1.324097 -0.055164
2  0.164034  0.586555  0.736100  0.892540
3 -0.469863 -1.114333       NaN  0.067884
4  0.448192  1.188342       NaN  1.233826

Table 7-2. concat function arguments

| Argument | Description |
| - | - |
| objs | List or dict of pandas objects to be concatenated. The only required argument |
| axis | Axis to concatenate along; defaults to 0 |
| join | One of 'inner', 'outer' , defaulting to 'outer' ; whether to intersection (inner) or union (outer) together indexes along the other axes |
| join_axes | Specific indexes to use for the other n-1 axes instead of performing union/intersection logic |
| keys | Values to associate with objects being concatenated, forming a hierarchical index along the concatenation axis. Can either be a list or array of arbitrary values, an array of tuples, or a list of arrays (if multiple level arrays passed in levels ) |
| levels | Specific indexes to use as hierarchical index level or levels if keys passed |
| names | Names for created hierarchical levels if keys and / or levels passed |
| verify_integrity | Check new axis in concatenated object for duplicates and raise exception if so. By default ( False ) allows duplicates |
| ignore_index | Do not preserve indexes along concatenation axis , instead producing a new range(total_length) index |

## combining data w/ overlap

### combine_First

In [67]:
a = Series(
    [np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
    index=['f', 'e', 'd', 'c', 'b', 'a'])
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [70]:
b = Series(np.arange(len(a), dtype=np.float64),
index=['f', 'e', 'd', 'c', 'b', 'a'])
b[-1] = np.nan
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [72]:
np.where(pd.isnull(a),b,a)

array([ 0. ,  2.5,  2. ,  3.5,  4.5,  nan])

In [77]:
a.combine_first(b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    NaN
dtype: float64

with df, its equivalent to patching the data

In [79]:
df1 = DataFrame({
    'a': [1., np.nan, 5., np.nan],
    'b': [np.nan, 2., np.nan, 6.],
    'c': range(2, 18, 4)})
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [80]:
df2 = DataFrame({
    'a': [5., 4., np.nan, 3., 7.],
    'b': [np.nan, 3., 4., 6., 8.]})
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

only the NaN entries in df1 replaced with the corresponding ones from df2

In [81]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

# Reshaping and pivoting

## reshaping with hierarchical indexing

* stack : this “rotates” or pivots from the columns in the data to the rows
* unstack : this pivots from the rows into the columns

In [82]:
data = DataFrame(np.arange(6).reshape((2, 3)),
index=pd.Index(['Ohio', 'Colorado'], name='state'),
columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [83]:
data.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [84]:
data.stack().unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

By default the innermost level is unstacked (same with stack ). You can unstack a different level by passing a level number or name:

In [85]:
data.stack().unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [86]:
data.stack().unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

unstacking might introduce NaN's

In [87]:
s1 = Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s1

a    0
b    1
c    2
d    3
dtype: int64

In [88]:
s2 = Series([4, 5, 6], index=['c', 'd', 'e'])
s2

c    4
d    5
e    6
dtype: int64

In [89]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [90]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

Stacking filters out NaN's by default, which ofc can be overridden

In [91]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [92]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

Choosing the level which gets stacked / unstacked  
by default, the innermost -> innermost in either direction

In [96]:
data = DataFrame(np.arange(6).reshape((2, 3)),
index=pd.Index(['Ohio', 'Colorado'], name='state'),
columns=pd.Index(['one', 'two', 'three'], name='number'))
result = data.stack()
df = DataFrame(
    {'left': result, 'right': result + 5},
    columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

unstack: movies number from row to col

In [97]:
df.unstack()

side     left           right
number    one two three   one two three
state
Ohio        0   1     2     5   6     7
Colorado    3   4     5     8   9    10

In [98]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [99]:
df.unstack('state').stack('side')

state         Ohio  Colorado
number side
one    left      0         3
       right     5         8
two    left      1         4
       right     6         9
three  left      2         5
       right     7        10

## Pivoting from long to wide format

In [461]:
ldata = pd.read_csv('7-long-to-wide.csv',
                    converters={
                        'year': lambda x: int(float(x)),
                        'quarter': lambda x: int(float(x))
                    })
ldata2 = ldata[['year','quarter','realgdp','infl','unemp']]
ldata2.head()

   year  quarter   realgdp  infl  unemp
0  1959        1  2710.349  0.00    5.8
1  1959        2  2778.801  2.34    5.1
2  1959        3  2775.488  2.74    5.3
3  1959        4  2785.204  0.27    5.6
4  1960        1  2847.699  2.31    5.2

shitting way to data wrangling

In [486]:
day_by_quarter = {1: '31', 2: '30', 3: '30', 4: '31'}
days = [day_by_quarter[x] for x in ldata2['quarter'].values]
m_d = zip(list(3*ldata2['quarter'].values),days)
y_m_d = zip(ldata2['year'].values,m_d)
days_of_our_lives = ['{0}-{1}-{2}'.format(x,y[0],y[1]) for x,y in y_m_d]
days_of_our_lives[:5]

['1959-3-31', '1959-6-30', '1959-9-30', '1959-12-31', '1960-3-31']

Sexy way of data wrangling

In [485]:
ldata2.apply(lambda r: "{0}-{1}-{2}".format(int(float(r[0])),int(r[1]*3),day_by_quarter[r[1]]), axis=1).head()

0     1959-3-31
1     1959-6-30
2     1959-9-30
3    1959-12-31
4     1960-3-31
dtype: object

In [466]:
ldata3 = DataFrame({
    'date': np.repeat(np.array(days_of_our_lives),3),
    'value': ldata2.values[:,2:].ravel(),
    'item': np.array(['realgdp','infl','unemp']*len(days_of_our_lives))},columns=['date','item', 'value'])
ldata3[:10]

         date     item     value
0   1959-3-31  realgdp  2710.349
1   1959-3-31     infl     0.000
2   1959-3-31    unemp     5.800
3   1959-6-30  realgdp  2778.801
4   1959-6-30     infl     2.340
5   1959-6-30    unemp     5.100
6   1959-9-30  realgdp  2775.488
7   1959-9-30     infl     2.740
8   1959-9-30    unemp     5.300
9  1959-12-31  realgdp  2785.204

In [468]:
pivoted = ldata3.pivot('date','item','value')
pivoted.head()

item        infl   realgdp  unemp
date
1959-12-31  0.27  2785.204    5.6
1959-3-31   0.00  2710.349    5.8
1959-6-30   2.34  2778.801    5.1
1959-9-30   2.74  2775.488    5.3
1960-12-31  1.21  2802.616    6.3

In [470]:
ldata3['value2'] = np.random.randn(len(ldata3))
ldata3[:10]

         date     item     value    value2
0   1959-3-31  realgdp  2710.349 -0.177261
1   1959-3-31     infl     0.000 -2.307398
2   1959-3-31    unemp     5.800 -0.691038
3   1959-6-30  realgdp  2778.801  0.212106
4   1959-6-30     infl     2.340 -0.118597
5   1959-6-30    unemp     5.100 -0.577257
6   1959-9-30  realgdp  2775.488  0.738529
7   1959-9-30     infl     2.740  0.565050
8   1959-9-30    unemp     5.300 -1.578233
9  1959-12-31  realgdp  2785.204  0.677143

In [472]:
pivoted2 = ldata3.pivot('date','item')
pivoted2.head()

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-12-31  0.27  2785.204   5.6  0.294611  0.677143 -0.064906
1959-3-31   0.00  2710.349   5.8 -2.307398 -0.177261 -0.691038
1959-6-30   2.34  2778.801   5.1 -0.118597  0.212106 -0.577257
1959-9-30   2.74  2775.488   5.3  0.565050  0.738529 -1.578233
1960-12-31  1.21  2802.616   6.3  0.163236  0.190003 -0.838490

In [473]:
pivoted2['value'].head()

item        infl   realgdp  unemp
date
1959-12-31  0.27  2785.204    5.6
1959-3-31   0.00  2710.349    5.8
1959-6-30   2.34  2778.801    5.1
1959-9-30   2.74  2775.488    5.3
1960-12-31  1.21  2802.616    6.3

Note that pivot is just a shortcut for creating a hierarchical index using set_index and reshaping with unstack

In [475]:
unstacked = ldata3.set_index(['date','item']).unstack('item')
unstacked.head()

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-12-31  0.27  2785.204   5.6  0.294611  0.677143 -0.064906
1959-3-31   0.00  2710.349   5.8 -2.307398 -0.177261 -0.691038
1959-6-30   2.34  2778.801   5.1 -0.118597  0.212106 -0.577257
1959-9-30   2.74  2775.488   5.3  0.565050  0.738529 -1.578233
1960-12-31  1.21  2802.616   6.3  0.163236  0.190003 -0.838490

# Data transformation

## removing duplicates

In [490]:
data = DataFrame({
    'k1': ['one'] * 3 + ['two'] * 4,
'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [489]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [491]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

Dropping duplicates based on a column name

In [493]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
3  two   3

In [494]:
data.drop_duplicates(['k1'], take_last=True)

/home/dragon/.local/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: the take_last=True keyword is deprecated, use keep='last' instead
  if __name__ == '__main__':

    k1  k2
2  one   2
6  two   4

## transforming using a function or mapping

In [496]:
data = DataFrame({
    'food': ['bacon', 'pulled pork', 'bacon', 
             'Pastrami', 'corned beef', 'Bacon',
             'pastrami', 'honey ham','nova lox'],
    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [497]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [503]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [506]:
data['animal_2'] = data['food'].map(lambda x: meat_to_animal[str.lower(x)])
data

          food  ounces  animal animal_2
0        bacon     4.0     pig      pig
1  pulled pork     3.0     pig      pig
2        bacon    12.0     pig      pig
3     Pastrami     6.0     cow      cow
4  corned beef     7.5     cow      cow
5        Bacon     8.0     pig      pig
6     pastrami     3.0     cow      cow
7    honey ham     5.0     pig      pig
8     nova lox     6.0  salmon   salmon

## replacing values

In [507]:
data = Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [508]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

replacing multiple values

In [509]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [512]:
data.replace([-999,-1000],[np.nan,-1])

0    1.0
1    NaN
2    2.0
3    NaN
4   -1.0
5    3.0
dtype: float64

In [513]:
data.replace({-999: np.nan, -1000: -1})

0    1.0
1    NaN
2    2.0
3    NaN
4   -1.0
5    3.0
dtype: float64

## replacing axis indexes

In [515]:
data = DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

like series, axis indices have a map function

In [516]:
data.index.map(str.upper)

array(['OHIO', 'COLORADO', 'NEW YORK'], dtype=object)

Transformed data w/o touching the original

In [517]:
data.rename(index = str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

with dict

In [520]:
data.rename(index={'Ohio': 'Indiana'}, columns={'three': 3, 'five': 5})

          one  two   3  four
Indiana     0    1   2     3
Colorado    4    5   6     7
New York    8    9  10    11

to rename in place, set `inplace = True`

## discretization and binning

### using pd.cut

In [521]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [522]:
bins = [18,25,35,60,100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [523]:
cats.labels

/home/dragon/.local/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: 'labels' is deprecated. Use 'codes' instead
  if __name__ == '__main__':

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [526]:
cats.categories

Index(['(18, 25]', '(25, 35]', '(35, 60]', '(60, 100]'], dtype='object')

In [527]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

default binning is left-open-right-closed.  
this can be changed to left-closed-right-open by setting `right=False`

In [528]:
pd.cut(ages,[18,26,36,61,100])

[(18, 26], (18, 26], (18, 26], (26, 36], (18, 26], ..., (26, 36], (36, 61], (36, 61], (36, 61], (26, 36]]
Length: 12
Categories (4, object): [(18, 26] < (26, 36] < (36, 61] < (61, 100]]

Can pass bin names

In [529]:
pd.cut(ages, bins, labels=['Youth','Young Adult', 'Middle Aged', 'Senior'])

[Youth, Youth, Youth, Young Adult, Youth, ..., Young Adult, Senior, Middle Aged, Middle Aged, Young Adult]
Length: 12
Categories (4, object): [Youth < Young Adult < Middle Aged < Senior]

specifying number of bins

In [530]:
data = np.random.rand(20)
data

array([ 0.17280665,  0.68958908,  0.43465544,  0.14382944,  0.90685321,
        0.19154835,  0.39968867,  0.68892367,  0.35706512,  0.85431877,
        0.23240759,  0.90400698,  0.06640662,  0.54475882,  0.22007712,
        0.44439488,  0.48196673,  0.09642122,  0.85226602,  0.19184143])

This cuts the range into 4 subranges

In [532]:
pd.cut(data, 4, precision=2)

[(0.066, 0.28], (0.49, 0.7], (0.28, 0.49], (0.066, 0.28], (0.7, 0.91], ..., (0.28, 0.49], (0.28, 0.49], (0.066, 0.28], (0.7, 0.91], (0.066, 0.28]]
Length: 20
Categories (4, object): [(0.066, 0.28] < (0.28, 0.49] < (0.49, 0.7] < (0.7, 0.91]]

to get roughly equal size bins, use qcut

In [535]:
cats = pd.qcut(np.random.randn(100), 4)
cats

[[-2.109, -0.521], [-2.109, -0.521], (0.564, 2.253], (0.564, 2.253], (0.564, 2.253], ..., (0.0731, 0.564], (-0.521, 0.0731], (0.564, 2.253], (-0.521, 0.0731], (-0.521, 0.0731]]
Length: 100
Categories (4, object): [[-2.109, -0.521] < (-0.521, 0.0731] < (0.0731, 0.564] < (0.564, 2.253]]

In [536]:
pd.value_counts(cats)

(0.564, 2.253]      25
(0.0731, 0.564]     25
(-0.521, 0.0731]    25
[-2.109, -0.521]    25
dtype: int64

specifying the bins for qcut

In [537]:
pd.qcut(np.random.randn(100), [0, 0.1, 0.5, 0.8, 1.0])

[(-0.973, 0.187], (0.187, 0.995], (0.995, 2.555], (-0.973, 0.187], (-0.973, 0.187], ..., (0.187, 0.995], [-1.712, -0.973], [-1.712, -0.973], (0.995, 2.555], (-0.973, 0.187]]
Length: 100
Categories (4, object): [[-1.712, -0.973] < (-0.973, 0.187] < (0.187, 0.995] < (0.995, 2.555]]

## detecting and filtering outliers

In [538]:
np.random.seed(12345)
data = DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

finding values exceeding 3 in magnitude

In [539]:
data[3][np.abs(data[3]) > 3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

selecting rows having a value > 3 or -3

In [545]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

to cap values to [-3,3]

In [547]:
data[(np.abs(data)>3)] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

the min and max values are now -3 and +3

## permutation and random sampling

In [550]:
df = DataFrame(np.arange(5*4).reshape(5,4))
sampler = np.random.permutation(5)
sampler

array([1, 3, 0, 2, 4])

In [551]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [552]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19

sampling w/o replacement

with replacement

In [558]:
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19

In [557]:
df.take(np.random.randint(5))

TypeError: len() of unsized object

In [565]:
df.take(np.random.randint(0, len(df), size=len(df)))

    0   1   2   3
2   8   9  10  11
2   8   9  10  11
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15

## computing indicator/dummy variables

In [566]:
df = DataFrame({
    'key': ['b', 'b', 'a', 'c', 'a', 'b'],
    'data1': range(6)})
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [567]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

adding a prefix and joining

In [571]:
dummies = pd.get_dummies(
    df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [574]:
df.join(dummies)

   data1 key  key_a  key_b  key_c
0      0   b      0      1      0
1      1   b      0      1      0
2      2   a      1      0      0
3      3   c      0      0      1
4      4   a      1      0      0
5      5   b      0      1      0

multiple category shit

In [612]:
mnames = ['movie_id', 'title', 'genres']
df_movies = pd.read_table('7-movies.dat', sep='::', header=None, names=mnames)
df_movies[:3]

/home/dragon/.local/lib/python3.5/site-packages/ipykernel/__main__.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  from ipykernel import kernelapp as app

   movie_id                    title                        genres
0         1         Toy Story (1995)   Animation|Children's|Comedy
1         2           Jumanji (1995)  Adventure|Children's|Fantasy
2         3  Grumpier Old Men (1995)                Comedy|Romance

In [607]:
genre_arrs = movies['genres'].map(lambda x: x.split('|'))
genre_arrs.head()

0     [Animation, Children's, Comedy]
1    [Adventure, Children's, Fantasy]
2                   [Comedy, Romance]
3                     [Comedy, Drama]
4                            [Comedy]
Name: genres, dtype: object

sexy way to get unique genres

In [609]:
genres = sorted(set.union(*(set(x) for x in genre_arrs)))
genres[:5]

['Action', 'Adventure', 'Animation', "Children's", 'Comedy']

In [611]:
df_genres = DataFrame(np.zeros((len(genre_arrs),len(genres))), columns=genres, dtype=np.bool)
for ix, mv_g in enumerate(genre_arrs):
    df_genres.ix[ix, mv_g] = True
df_genres.head()

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,False,False,True,True,True,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,True,False,True,False,False,False,False,True,False,False,False,False,False,False,False,False,False
2,False,False,False,False,True,False,False,False,False,False,False,False,False,True,False,False,False,False
3,False,False,False,False,True,False,False,True,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False,False

In [616]:
df_movies.join(df_genres.add_prefix('G_')).head()

,movie_id,title,genres,G_Action,G_Adventure,G_Animation,G_Children's,G_Comedy,G_Crime,G_Documentary,...,G_Fantasy,G_Film-Noir,G_Horror,G_Musical,G_Mystery,G_Romance,G_Sci-Fi,G_Thriller,G_War,G_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,False,False,True,True,True,False,False,...,False,False,False,False,False,False,False,False,False,False
1,2,Jumanji (1995),Adventure|Children's|Fantasy,False,True,False,True,False,False,False,...,True,False,False,False,False,False,False,False,False,False
2,3,Grumpier Old Men (1995),Comedy|Romance,False,False,False,False,True,False,False,...,False,False,False,False,False,True,False,False,False,False
3,4,Waiting to Exhale (1995),Comedy|Drama,False,False,False,False,True,False,False,...,False,False,False,False,False,False,False,False,False,False
4,5,Father of the Bride Part II (1995),Comedy,False,False,False,False,True,False,False,...,False,False,False,False,False,False,False,False,False,False

Bins and 1-of-K

In [617]:
values = np.random.rand(10)
values

array([ 0.58577873,  0.74213703,  0.06344072,  0.66894584,  0.44300707,
        0.99955133,  0.04958322,  0.62787667,  0.04533641,  0.59105674])

In [625]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1.0]

In [627]:
pd.get_dummies(pd.cut(values, bins))

   (0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1]
0         0           0           1           0         0
1         0           0           0           1         0
2         1           0           0           0         0
3         0           0           0           1         0
4         0           0           1           0         0
5         0           0           0           0         1
6         1           0           0           0         0
7         0           0           0           1         0
8         1           0           0           0         0
9         0           0           1           0         0

# String manipulation

## string object methods

Table 7-3. Python built-in string methods

| Argument | Description |
| - | - |
| count | Return the number of non-overlapping occurrences of substring in the string. |
| endswith, startswith | Returns True if string ends with suffix (starts with prefix). |
| join | Use string as delimiter for concatenating a sequence of other strings. |
| index | Return position of first character in substring if found in the string. Raises ValueError if not found. |
| find | Return position of first character of first occurrence of substring in the string. Like index , but returns -1 if not found. |
| rfind | Return position of first character of last occurrence of substring in the string. Returns -1 if not found. |
| replace | Replace occurrences of string with another string. |
| strip, rstrip, lstrip | Trim whitespace, including newlines; equivalent to x.strip() (and rstrip, lstrip , respectively) for each element. |
| split | Break string into list of substrings using passed delimiter. |
| lower, upper | Convert alphabet characters to lowercase or uppercase, respectively. |
| ljust, rjust | Left justify or right justify, respectively. Pad opposite side of string with spaces (or some other fill character) to return a string with a minimum width. |

## regex

Table 7-5. Vectorized string methods

| Method | Description |
| - | - |
| cat | Concatenate strings element-wise with optional delimiter |
| contains | Return boolean array if each string contains pattern/regex |
| count | Count occurrences of pattern |
| endswith, startswith | Equivalent to x.endswith(pattern) or x.startswith(pattern) for each element. |
| findall | Compute list of all occurrences of pattern/regex for each string |
| get | Index into each element (retrieve i-th element) |
| join | Join strings in each element of the Series with passed separator |
| len | Compute length of each string |
| lower, upper | Convert cases; equivalent to x.lower() or x.upper() for each element. |
| match | Use re.match with the passed regular expression on each element, returning matched groups as list. |
| pad | Add whitespace to left, right, or both sides of strings |
| center | Equivalent to pad(side='both') |
| repeat | Duplicate values; for example s.str.repeat(3) equivalent to x * 3 for each string. |
| replace | Replace occurrences of pattern/regex with some other string |
| slice | Slice each string in the Series. |
| split | Split strings on delimiter or regular expression |
| strip, rstrip, lstrip | Trim whitespace, including newlines; equivalent to x.strip() (and rstrip, lstrip , respectively) for each element. |